app/Http/Controllers/AdminInputController.php

select * from `users` where `id` = '3' limit 1
---
    private function  getUserName($userid){
        $output = DB::table('users')->where('id',$userid)->first();