app/Http/Controllers/AdminInputController.php

select * from `provinces`
select * from `amphures`
select * from `users`
---
    public function create()
    {
        $list = DB::table('provinces')->get();
        $listtwo = DB::table('amphures')->get();
        $listthree = DB::table('users')->get();

select * from `provinces`
select * from `amphures`
select * from `jobs_img`
select * from `users`
---
    public function edit($id)
    {
        $list = DB::table('provinces')->get();
        $listtwo = DB::table('amphures')->get();
        $job = Job::find($id);
        $listthree = DB::table('jobs_img')->get();
        $listfour = DB::table('users')->get();

        return view('admin.edit', compact('job'))->with('list', $list)->with('listtwo', $listtwo)->with('listthree', $listthree)->with('listfour', $listfour);

select * from `users` where `id` = '3' limit 1
---
    private function  getUserName($userid){
        $output = DB::table('users')->where('id',$userid)->first();