app/Http/Controllers/AutoCompleteController.php

    function show(Request $request){
    	if($request->get('query')){
    		$query=$request->get('query');
    		//echo $query;
    		$data = DB::table('provinces')->where('name_th', 'LIKE', "{$query}%") ->get();
---
select * from `provinces` where `name_th` LIKE 'ศ%'

	public function showamphur(Request $request){
		if($request->get('query')){
    		$query=$request->get('query');
    		//echo $query;
    		$data = DB::table('amphures')->where('name_th', 'LIKE', "{$query}%") ->get();
---
select * from `amphures` where `name_th` LIKE 'บา%'