app/Http/Controllers/DropdownController.php

	function fetch(Request $request)
	{
		$id = $request->get('select');
		$query = DB::table('provinces')
			->join('amphures', 'provinces.id', '=', 'amphures.province_id')
			->select('amphures.code', 'amphures.name_th')
			->where('provinces.code', $id)
			->groupBy('amphures.code', 'amphures.name_th')
			->get();
---
select `amphures`.`code`, `amphures`.`name_th` from `provinces` inner join `amphures` on `provinces`.`id` = `amphures`.`province_id` where `provinces`.`code` = '18' group by `amphures`.`code`, `amphures`.`name_th`