app/Http/Controllers/JobController.php

select * from `vw_order` where `HideResult` LIKE '%เดอะเบส%' order by `id` desc limit 10 offset 0
select count(*) as aggregate from `vw_order` where `HideResult` LIKE '%เดอะเบส%'
---
    public function allJobs(Request $request){

     //front search
        $search = $request->get('search');
        $replaced = str_replace(' ', '%', $search);
        if($search){

           //$jobs = Job::where('projectname','LIKE','%'.$replaced.'%')->orderBy('id', 'DESC')->paginate(10);
           //$jobs = DB::table('vw_order')->where('HideResult','LIKE','%'.$replaced.'%')->get();
           //$jobs = DB::table('vw_order')->get();
           //dd($jobs);

           $jobs = DB::table('vw_order')
           ->where('HideResult','LIKE','%'.$replaced.'%')
           ->orderBy('id', 'DESC')
           ->paginate(10);