app/Http/Controllers/ReportController.php

select * from `provinces`
select * from `amphures`
select * from `jobs_img`
select * from `transportation`
select * from `districts`
---
    public function edit($id)
    {
        $list = DB::table('provinces')->get();
        $listtwo = DB::table('amphures')->get();
        $job = Job::find($id);
        $listthree = DB::table('jobs_img')->get();
        $list_transportation = DB::table('transportation')->get();
        $list_district = DB::table('districts')->get();